import logging


######## 1. Стандартная библиотека Python

#### . Обзор библиотеки целиком

''' Библиотека содержит:
● Встроенные функции
● Встроенные константы
● Встроенные типы
● Встроенные исключения
● Услуги обработки текста
● Службы двоичных данных
● Типы данных
● Числовые и математические модули
● Модули функционального программирования
● Доступ к файлам и каталогам
● Сохранение данных
● Сжатие данных и архивирование
● Форматы файлов
● Криптографические услуги
● Общие службы операционной системы
● Параллельное выполнение
● Сеть и межпроцессное взаимодействие
● Обработка данных в Интернете
● Инструменты обработки структурированной разметки
● Интернет-протоколы и поддержка
● Мультимедийные услуги
● Интернационализация
● Программные фреймворки
● Графические пользовательские интерфейсы с Tk
● Инструменты разработки
● Отладка и профилирование
● Упаковка и распространение программного обеспечения
● Службы выполнения Python
● Пользовательские интерпретаторы Python
● Импорт модулей
● Языковые службы Python
● Специальные службы MS Windows
● Специальные службы Unix
● Замененные (устаревшие) модули
'''

######## 2. Модель logging

logging.info('Немного информации')
logging.error('Поймали ошибку')
